# MERGING AND JOINING

## [The concat function](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.concat.html)

In [42]:
import pandas as pd
import numpy as np

In [54]:
data1 = pd.read_csv('../data/data1.csv').set_index('Name')
data1

          A   B    C    D
Name
LYB    45.0  74  263  944
OIV   272.0  72  465  242
MBE    65.0  25  833  627
VYV     NaN  68   92   73

In [55]:
data2 = pd.read_csv('../data/data2.csv').set_index('Name')
data2

        B     C    D
Name
BMA   836   123  378
BAD   545  6452  838

In [56]:
data3 = pd.read_csv('../data/data3.csv').set_index('Name')
data3

       D
Name
JEI   23
VWI   82

Here, we perform a concatenation by specifying an outer join, which concatenates and performs a union on all the three data frames, and includes entries that do not have values for all the columns by inserting NaN for such columns:

In [57]:
pd.concat([data1, data2, data3], axis=0)

          A      B       C    D
Name
LYB    45.0   74.0   263.0  944
OIV   272.0   72.0   465.0  242
MBE    65.0   25.0   833.0  627
VYV     NaN   68.0    92.0   73
BMA     NaN  836.0   123.0  378
BAD     NaN  545.0  6452.0  838
JEI     NaN    NaN     NaN   23
VWI     NaN    NaN     NaN   82

We can also specify an inner join that does the concatenation, but only includes rows that contain values for all the columns in the final data frame by throwing out rows with missing columns, that is, it takes the intersection:

In [58]:
pd.concat([data1, data2, data3], axis=0, join='inner')

        D
Name
LYB   944
OIV   242
MBE   627
VYV    73
BMA   378
BAD   838
JEI    23
VWI    82

In [63]:
prices1 = pd.read_csv('../data/prices1.csv').set_index('Name')
prices1

       A   B
Name
IJK    6  84
NAE   47  73
OPQ   37  26
MNW   87  64

In [64]:
prices2 = pd.read_csv('../data/prices2.csv').set_index('Name')
prices2

        C
Name
OPQ   635
MNW    42

In [65]:
prices3 = pd.read_csv('../data/prices3.csv').set_index('Name')
prices3

        D
Name
NAE    25
OPQ    42
MNW   846
LWX   933

In [66]:
pd.concat([prices1, prices2, prices3], axis=1)

        A     B      C      D
IJK   6.0  84.0    NaN    NaN
LWX   NaN   NaN    NaN  933.0
MNW  87.0  64.0   42.0  846.0
NAE  47.0  73.0    NaN   25.0
OPQ  37.0  26.0  635.0   42.0

In [67]:
pd.concat([prices1, prices2, prices3], axis=1, join='inner')

       A   B    C    D
Name
OPQ   37  26  635   42
MNW   87  64   42  846

In [68]:
pd.concat([prices1, prices2, prices3], axis=1, join_axes=[df.index])

         A     B      C      D
Name
IJK    6.0  84.0    NaN    NaN
NAE   47.0  73.0    NaN   25.0
OPQ   37.0  26.0  635.0   42.0
MNW   87.0  64.0   42.0  846.0
LWX    NaN   NaN    NaN  933.0
MQE    NaN   NaN    NaN    NaN
ITD    NaN   NaN    NaN    NaN

## Using append

The append function is a simpler version of concat that concatenates along axis=0.

In [69]:
values1 = pd.read_csv('../data/values1.csv').set_index('ID')
values1

      Value1  Value2  Value3  Value4  Value5
ID
A643      89      67      98     568     687
B843      73      53     827      43     286
C426      38     457     297      54     735

In [70]:
values2 = pd.read_csv('../data/values2.csv').set_index('ID')
values2

      Value1  Value2  Value3
ID
H013      27      84      25
I725      84      92      31
J274      35     833      72

In [71]:
values1.append(values2)

      Value1  Value2  Value3  Value4  Value5
ID
A643      89      67      98   568.0   687.0
B843      73      53     827    43.0   286.0
C426      38     457     297    54.0   735.0
H013      27      84      25     NaN     NaN
I725      84      92      31     NaN     NaN
J274      35     833      72     NaN     NaN

## Appending a single row to a DataFrame
We can append a single row to a DataFrame by passing a series or dictionary to the append method:

In [76]:
grades = pd.read_csv('../data/grades.csv')
grades

    Name  Math  Physics  Chemistry
0  Henry   5.8      9.3        4.3
1   Jack   8.7      9.2        5.6
2  Susan   5.5      7.6        8.4

In [78]:
moreGrade = {
    'Name': 'John',
    'Math': 8.3,
    'Physics': 4.8,
    'Chemistry': 7.7
}
grades.append(moreGrade, ignore_index=True)

    Name  Math  Physics  Chemistry
0  Henry   5.8      9.3        4.3
1   Jack   8.7      9.2        5.6
2  Susan   5.5      7.6        8.4
3   John   8.3      4.8        7.7